In [1]:
import pandas as pd

In [7]:
df = pd.DataFrame(
{"a" : [4 ,5, 6, 4],
"b" : [7, 8, 9, 9],
"c" : [10, 11, 12, 10]},
index = [1, 2, 3, 4])

In [4]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [5]:
# 1차원 구조
df["a"]

1    4
2    5
3    6
Name: a, dtype: int64

In [6]:
# 2차원 구조
df[["a"]]

   a
1  4
2  5
3  6

# Summarize Data

In [8]:
df["a"].value_counts()

4    2
6    1
5    1
Name: a, dtype: int64

## sort_values, drop

In [9]:
df["a"].sort_values()

1    4
4    4
2    5
3    6
Name: a, dtype: int64

In [10]:
df.sort_values("a", ascending=False)

   a  b   c
3  6  9  12
2  5  8  11
1  4  7  10
4  4  9  10

In [11]:
# column 기준 drop
df.drop(["c"], axis=1, inplace = True)

In [12]:
df

   a  b
1  4  7
2  5  8
3  6  9
4  4  9